[{"title":"读书笔记：明朝一哥王阳明","date":"2017-04-09T08:38:26.000Z","path":"2017/04/09/读书笔记：明朝一哥王阳明/","text":"彼时终于发现圣贤不是那么好做的，也没有精力再去格物了！ 于是，闷闷不乐的王守仁不得不掉转头来研究自己曾经看不上眼的“辞章之学”，准备科考。 然而，事实证明天不是随随便便就将降大任于斯人的—博学多才的王守仁在弘治六年的会试中落榜了。 当周围落第的同学哭天抢地、寻死觅活时，不为外物所屈的王守仁却说：“世以不得第为耻，吾以不得第动心为耻。” 自己对待考研的态度也是这样的，认真准备，但行好事，不问前程。 但王阳明跟普通人的不同之处就在于，他总能全面地把握事物的两面性，在自己偏激的时候立刻将心态调整到中间状态。比如他对仕途偃蹇感到郁闷时，马上又说：“天下之事，其得之不难，则其失之必易；其积之不久，则其发之必不宏。” 之所以这么独到深刻，皆因其务实到极点的思维方式。 心学教会了我们一件事—不要被自己一时的情绪所左右，偏激永远是因为你看得还不够多。 得之不难，失之必易。讲的还是挺有道理的，和周易一样，看事物要有两面性。 最简单的例子遇到一个难学的科目，学习的过程固然劳苦，但是学成之后也会觉得学有所值。 世界是多元的（多维度），只有站在更高的维度，才能看清低纬度发生的事，它们是同时存在的事实，打个比方：瞎子感觉不到光和颜色；聋子感觉不到声音，但并不表示它们没有，它们都是一种真实的存在。 而另一方面，人择原理认为，宇宙之所以这样，是因为我们感觉到它这样。换句话说，我们之所以活在一个看似调控得如此准确，以至于能孕育出生命的宇宙之中，是因为如果宇宙不是调控得如此准确，人类便不会存在，更遑论观察宇宙。如果任何一个基本物理常数跟现有的存在足够的差异，那么我们所知的生命便不会存在，更不会有智慧生物去思考宇宙。 如果这个世界曾出现过无数次可能。那么，只有这一次，产生了你和我。 世界的可能性太多，想想这么多原子，经历了几亿年，最终是你身上的这些组成了你。不由的就有一种敬重之感。也想对自己生命更加负责，把握这一生的时间，积极向上的去做一点事情出来。 待一切都安静下来，不管你站在什么立场，且只问一句话：多久没有倾听自己的内心了？ 其实，世界是什么样并不重要，重要的是你需要什么。 这个也挺难说的，很多时候，人并不能分清楚，自己想要什么，到底是自己真的想要，还是因为社会这么多年都是这么告诉你的，所以你才会去想要。 阳明说，人最怕的就是没有志向，有了志向，做起来，就会成就自己。他告诉黄绾，有一条简捷的道路可以通向那个目标，那就是做减法。人活在缠蔽之中，所谓的减法就是去蔽，把树林中的一条条岔路砍掉，把屋子里多余的东西搬掉，这样，我们的心，就成了一个空荡荡的房间，可以让阳光进来。所以，人心在这里是一个关键，一个让天地万物得以呈现意义的关键。 分手时，阳明再次强调：做起来，就能成，你要相信人可以凭借意志和内在的修炼成为你想成为的人。 以前有段时间自己挺无所事事的，就习惯一直刷手机上的app，比如zhihu，营地，刷视频网站看自己喜欢的up主出新视频没。后来突然觉悟，还有很多要学的东西没看呢，还有一些书啊都还躺在kindle里没看完。明白了人其实不会闲下来，永远都是有事情可以做的。要是你现在处于没事干的状态，就应该警醒一下了。 记得看过有点相关的说法，一个人有没有空，取决于是做什么事情，这个时候自己做毕设写论文几千字自然是有空的，你要让我帮你写个几百字的作文，应该就不乐意了。 周莹委屈无比：“没有人强迫。只是我曾经在河边见过树的倒影，明白高度决定长度。我不甘为人下之人，才四处求学。如今既已决心投入先生门下，在别人看来艰难劳苦之事，在我这里却甘之如饴，又怎会轻易放弃？” 王阳明抚掌大笑：“你舟马劳顿，不辞辛苦，终于实现了愿望。这是谁教你的方法？不都是你自己的主意吗？既如此，你立志于圣贤之学，自然也会用这种方法去追求。现在还需要我教你方法吗？” 周莹听完，恍然大悟，不禁欢呼雀跃。 所以也没有什么不会做的事情，不会只可能是一个暂时的状态。真要想做，总能想出方法来解决的，无论优劣。 黄绾不明白的是，王阳明欲矫程朱之枉，不得不过正，不得不用坚定不移的语气告诉世人：判断人生价值的标准不在外部世界，不在官职高低、权势大小，而在你的内心。心安自足、充实强大才是安身之本、成功之基。 然而，正是由于黄绾长年累月地找碴挑刺，才成就了一个完满的心学理论。 不好说啥，感觉自己的境界还没到这个程度，虽然对money的欲望可能没这么强烈。但是终究还是要养活养胖自己嘛，所以还是想多赚点钱的。 因为在这个世界上，有人想一脚两船、左右逢源，有人想不问是非、抽身事外，但只有立场坚定的人，才可能有所作为。 谢志珊信仰坚定，见到志同道合的好汉必定想方设法结交。好酒者纵其酒，有难者助其急，肝胆相照，和衷共济。如此一来，没有不归顺他的。 王阳明目送着谢志珊被带出军帐，感慨万千。 以前也是，总想工作考研两手抓，备考的时候觉得哪个同学找了一份好工作，就挺羡慕的。不过这一段经历也算不错，能让自己明白自己欲望太多，想要的太多。反而经历过这一段长时间的焦虑，对自己的为人处世、心境修为都有所上升。这也映照了上面的一点，事物都是有两面性，经历的时候觉得痛苦想早点过去，过完了又觉得是不错的经历。 无善无恶心之体是你精神追求的最高境界，但其本身不是你人生的终极目标。通过对“无”的深刻体验，最终是为了实现人生“有”的价值，达到“终日有为而心常无为”的圣人气象。 然而，一切的一切，都自致良知始。絮絮叨叨了这么多，我且代王阳明问你一句：你是否愿意信此良知忍耐去做，不管人非笑，不管人毁谤，不管人荣辱，任他功夫有进有退，我只是这致良知的主宰不息，久之自然有得力处，从而毫无馁歉，纵横自在，轻重厚薄，随感随应，我只变动不居？ 阳明心学，在此终结。 理解还不够，等学习完浙江大学的心学课程和传习录再回来补充想法吧。 有什么关系呢？父亲的死让阳明沉寂了许多，他的心已不在那片曾经向往的宫阙庙堂之间，荣辱毁誉，听其自然。夏天在微风的吹拂中鉴湖赏荷；冬天去欣赏姚江的雪景；春日微醺的和风里，则带着食物和酒具，同弟子们去城外踏青郊游…… 看来人到了最后，是不会在在意这些世俗的东西了啊。 对于这两个徒弟，王阳明因材施教。钱德洪办事踏实却不够果断，阳明便告诫他“心要洒脱”；王畿悟性极高却散漫拖沓、玩世不恭，阳明便提醒他“心要严谨”。 钱德洪将阳明的教学方法归纳为：“仅指揭学问大旨，让学生自己去领悟、证实。” 这是一种比量产式的应试教育科学百倍的教学方法。因为学生本人有资质和性格上的差异，学生提出的问题也有其特定的时间和背景，如果解答过于具体，成为教条，时过境迁将遗祸无穷。所以，只告诉学生解决问题的原则，让他自己去琢磨。这种启发式的教育，可以使每个人都获益匪浅。 感觉与孔子的因材施教差不多，虽然我挺不喜欢孔子那一套的。自己也应该根据自己的特点来做事情。每个人情况不同，做事，学习的方法也不能完全照搬。 周以善见他面色红润，还有些欣慰，不料阳明却平静地告诉他：“我要去了。” 周以善一愣，待反应过来，鼻子一酸，眼泪不禁夺眶而出。他顾不得去拭，凑近了泣不成声道：“老师，您还有什么话要说吗？” 刹那间，千言万语涌上心头。朝廷、家庭、朋友、同僚、平乱、讲学……一组组词语，一幕幕片段，就像银行门口挤兑的人群，争先恐后，奔向喉头。 然而，说了一辈子话的王阳明确实早已说够，无话可说。他对周以善微微一笑，淡然道：“此心光明，亦复何言？” “此心光明，亦复何言？”看到这，也不由的落泪，将王阳明的一生都下来，看过他的迷茫思索，也看过他历经苦难，偶有反转，否极泰来。官场得意之后，也可能过一段时间又被冷落贬职。路边遇上的陌路人，流落异乡，不知道路在何方，赠诗于他，互相鼓励。明明是平反的功臣，却因为皇帝身边小人的言语遭受怀疑…… 自己也是因为这一句话，才开始学习的王阳明心学。 至此，终于可以也愿意称得上一声老师。 “日间工夫觉纷扰，则静坐。觉懒看书，则且看书。是因病而药。” 如果白天做工夫觉得纷扰不安，那么就静坐。如果懒得看书，就强行去看书，这也是对症下药的方法 你庸庸碌碌，四处碰壁，直到有一天，发现把自己放空，看清了为什么活，要怎么活，与他人无关，心安自足，如同站在万仞悬崖边，即使风声鹤唳，也不再凄冷孤寂，因为那个饱满的自性，正与你紧密相依。 怀着这样的精神，做这样的事，不再有任何挂碍和恐惧，任何流言蜚语都与这个生命无关。你终于明白了要做什么样的人才会觉得淋漓尽致、没有虚度。 人如果厘清自己生命的意义，把全部的意念都放在实践生命意义的斗志里，那种酣畅纯粹的美，就是心学。 最后一段，不想多言，还是留给各位看官各自思考吧。","tags":[{"name":"read","slug":"read","permalink":"https://hagridthick.github.io/tags/read/"},{"name":"心学","slug":"心学","permalink":"https://hagridthick.github.io/tags/心学/"},{"name":"哲学","slug":"哲学","permalink":"https://hagridthick.github.io/tags/哲学/"}]},{"title":"读书总结：摆脱疲惫感","date":"2017-04-05T11:54:05.000Z","path":"2017/04/05/读书总结：摆脱疲惫感/","text":"面对疲劳的基本策略： 转做不同的事情，必须要与之前做的事情有认知差异，比如脑力活编程干累了，画画、手工、弹奏乐器都可以 人能高效工作的时间有限（通常不超过几小时），午间小憩、冥想放松都能够很好的恢复状态 喝咖啡、红牛属于应急方法、暂时缓解，确会让之后更加疲倦，长期使用此类策略不合理 足够长时间的睡眠，良好的睡眠能在一天的高压工作和疲惫后全面的恢复精神系统 疲劳耐性的提高方法： 每天能做多少事情，能高效工作多少时间，解决多少问题。如果再多则会有耗尽感、对工作的绝望感，从而需要一段时间才能恢复。 良好的生活习惯可以提高疲劳耐性、包括合理有规律的锻炼、不抽烟不喝酒、不搞社交隔离、少吃垃圾食品、充足睡眠 关起来大睡一觉，宅着打游戏，看电影，无所事事，只能低效的缓解疲劳，更需要的是走出去，和朋友一起参加锻炼活动–跑步、爬山、游泳、骑车、瑜伽、冥想。这些事情较少涉及脑力需求，能让我们获得很好的休息，同时社会联系可以让我们由于疲劳和压力产生的情绪有一个宣泄的出口 不要连续工作超过1个小时，过一段时间找点其他事情做做休息几分钟，喝水，起身走动。 拒绝“多线程”工作","tags":[{"name":"healthy","slug":"healthy","permalink":"https://hagridthick.github.io/tags/healthy/"},{"name":"read","slug":"read","permalink":"https://hagridthick.github.io/tags/read/"}]},{"title":"python3.6+opencv3.2","date":"2017-03-29T05:16:07.000Z","path":"2017/03/29/python3-6-opencv3-2/","text":"在Anaconda下载了最新版本的4.3.1(对应python3.6) 在尝试自动下载opencv,发现Anaconda还没有支持到3.6版本的python对应的opencv3.2,会报出冲突的错误 手动下载封装的安装包,目前是python3.6对应opencv3.2,之后更新了也可以找到对应的版本 OpenCV 3：http://www.lfd.uci.edu/~gohlke/pythonlibs/#opencv Numpy：http://www.lfd.uci.edu/~gohlke/pythonlibs/#numpy 找到下载的目录,右键在这里打开CMD,输入下列的命令安装(例子放在C盘,根据需要自己改盘符) pip install c:\\opencv_python-3.2.0-cp36-cp36m-win_amd64.whl pip install c:\\numpy-1.12.1+mkl-cp36-cp36m-win_amd64.whl 写个opencv测试一下,读取了当前目录的一张测试图片,成功获得输出的像素点的RGB 123456import cv2import numpy as npimg = cv2.imread('test.png')px = img[100, 100]print(px)","tags":[{"name":"python","slug":"python","permalink":"https://hagridthick.github.io/tags/python/"},{"name":"opencv","slug":"opencv","permalink":"https://hagridthick.github.io/tags/opencv/"}]},{"title":"Hello World","date":"2017-03-28T08:13:13.586Z","path":"2017/03/28/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]